app/views/devise/registrations/edit.html.erb

SELECT "regions".* FROM "regions"
---
      <div class="form-group col-md-6">
        <% options = options_from_collection_for_select(Region.all, 'territory', 'territory') %>