app/views/paintings/new.html.erb

SELECT  "funny_images".* FROM "funny_images"  WHERE "funny_images"."user_id" = ? LIMIT 1  [[nil, 7]]
---

<% if current_user.funny_image.present? %>