app/controllers/entertainments_controller.rb

SELECT "entertainments".* FROM "entertainments"  WHERE "entertainments"."user_id" = ?  [["user_id", 7]]
---
  def new
   @entertainment = Entertainment.new
    @entertainment.representative_name = current_user.try(:first_name)+" #{current_user.try(:middle_name)} "+current_user.try(:last_name)
    @entertainment.representative_id = current_user.try(:user_main_id)
    @entertainment.division = current_user.try(:division).try(:name)
    @entertainment.region = current_user.try(:region).try(:name)
    password_length = 12
    @entertainment.password = Devise.friendly_token.first(password_length)

SELECT  "entertainments".* FROM "entertainments"  WHERE "entertainments"."user_id" = ? AND "entertainments"."id" = ? LIMIT 1  [["user_id", 7], ["id", 3]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 7  ORDER BY "users"."id" ASC LIMIT 1
---
  def edit
    @entertainment = Entertainment.find(params[:id])
    if(@entertainment.entertainment_parent_company.nil?)
      password_length = 12
      @password = Devise.friendly_token.first(password_length)
      @entertainment.ee_user_id = EntertainmentParentCompany.create(password: @password).id
      @entertainment.save(:validate => false)
    end
    redirect_to edit_entertainment_parent_company_path




    @entertainment_parent_company =  EntertainmentParentCompany.find(@entertainment.ee_user_id)

INSERT INTO "entertainments" ("category", "city", "contact_person_email", "contact_person_first_name", "contact_person_last_name", "contact_person_phone", "contact_person_position", "contact_person_salutation", "country", "created_at", "email", "function", "icon", "name", "parent_comapny_name", "parent_company_city", "parent_company_contact_person_email_address", "parent_company_contact_person_first_name", "parent_company_contact_person_last_name", "parent_company_contact_person_phone_number", "parent_company_contact_person_salutation", "parent_company_country", "parent_company_postal_code", "parent_company_state_or_province", "parent_company_street_address_1", "parent_company_street_address_2", "password", "phone_number", "postal_code", "region", "representative_id", "state_or_province", "street_address_1", "street_address_2", "sub_category", "updated_at", "url", "url_picture", "user_id", "webpage_director_company", "webpage_director_contact_person_first_name", "webpage_director_email_address", "webpage_director_last_name", "webpage_director_phone_number", "webpage_director_salutation") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    @entertainment = current_user.entertainments.build(entertainment_params)

    respond_to do |format|
      if @entertainment.save

SELECT  "entertainments".* FROM "entertainments"  WHERE "entertainments"."user_id" = ? AND "entertainments"."id" = ? LIMIT 1  [["user_id", 7], ["id", 5]]
DELETE FROM "entertainments" WHERE "entertainments"."id" = ?  [["id", 5]]
---
  def destroy
    @entertainment = current_user.entertainments.find(params[:id])
    @entertainment.destroy