app/controllers/paintings_controller.rb

	def create
		@painting = current_user.build_painting(product_params)
		if @painting.save
---
INSERT INTO "paintings" ("created_at", "image", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-08-20 06:19:49.446292"], ["image", "abc.jpg"], ["updated_at", "2014-08-20 06:19:49.446292"], ["user_id", 122]]

	def update

		if current_user.painting.update(product_params)
---
UPDATE "paintings" SET "image" = ?, "updated_at" = ? WHERE "paintings"."id" = 39  [["image", "acd.jpg"], ["updated_at", "2014-08-20 09:49:44.738495"]]

	def show
		@painting = User.find(current_user.id).painting
---
SELECT  "paintings".* FROM "paintings"  WHERE "paintings"."user_id" = ? LIMIT 1  [["user_id", 8]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 8  ORDER BY "users"."id" ASC LIMIT 1

	def create_funny_image
		@painting = current_user.build_funny_image(product_params)
		if @painting.save
---
INSERT INTO "funny_images" ("created_at", "image", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-08-22 08:48:51.366409"], ["image", "abc.jpg"], ["updated_at", "2014-08-22 08:48:51.366409"], ["user_id", 7]]