app/controllers/paintings_controller.rb

SELECT  "paintings".* FROM "paintings"   ORDER BY "paintings"."id" DESC LIMIT 1
---
	def show
		@painting = Painting.last