app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-08-20 11:45:49.927696"], ["name", "hello"], ["price", 12.0], ["updated_at", "2014-08-20 11:45:49.927696"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save