app/controllers/regions_controller.rb

	def create
		@region = Region.new(region_params)
		if @region.save
---
INSERT INTO "regions" ("created_at", "ee_score", "first_language", "gdp_usd_billion", "population", "second_language", "territory", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)